{"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"name": "conv2d_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "batch_input_shape": [null, 28, 28, 1], "padding": "valid", "bias_constraint": null, "filters": 32, "dtype": "float32", "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "strides": [1, 1], "use_bias": true, "kernel_size": [3, 3], "kernel_constraint": null, "trainable": true, "activation": "relu", "dilation_rate": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "padding": "valid", "trainable": true}}, {"class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout_1", "trainable": true, "seed": null, "rate": 0.25}}, {"class_name": "Conv2D", "config": {"name": "conv2d_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "activity_regularizer": null, "padding": "valid", "bias_constraint": null, "filters": 64, "data_format": "channels_last", "bias_regularizer": null, "strides": [1, 1], "trainable": true, "use_bias": true, "kernel_size": [3, 3], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "dilation_rate": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "padding": "valid", "trainable": true}}, {"class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout_2", "trainable": true, "seed": null, "rate": 0.25}}, {"class_name": "Conv2D", "config": {"name": "conv2d_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "activity_regularizer": null, "padding": "valid", "bias_constraint": null, "filters": 128, "data_format": "channels_last", "bias_regularizer": null, "strides": [1, 1], "trainable": true, "use_bias": true, "kernel_size": [3, 3], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "dilation_rate": [1, 1]}}, {"class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout_3", "trainable": true, "seed": null, "rate": 0.4}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"units": 128, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "activation": "relu"}}, {"class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout_4", "trainable": true, "seed": null, "rate": 0.3}}, {"class_name": "Dense", "config": {"units": 10, "name": "dense_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "activation": "softmax"}}], "keras_version": "2.1.5", "backend": "tensorflow"}